

# ЛБ №3. Простые деревья. Список соседства
# 1. Реализовать структуру таблиц, реализовывающую структуру для хранения деревьев «Список соседства» и позволяющую хранить данные выбранной тематики. Тематика может быть выбрана из списка предложенных 
# (см. Предлагаемые темы) или предложена студентом.
# 2. Наполнить данными реализованную структуру. Таблица с деревом должна содержать не менее 20 строк, каждый узел, не являющийся листом должен иметь от 2 до 5 потомков, общая глубина дерева должна быть не менее 4.
# 3. Реализовать программные функции, позволяющие выполнить следующие операции:
# — добавление листа;
# — удаление листа;
# — удаление поддерева;
# — удаление узла без поддерева;
# — получение прямых потомков;
# — получение прямого родителя;
# — получение всех потомков;
# — получение всех родителей;
# Дополнительная задача 1.
# - написаны миграции на создание каждой таблицы;
# - написана миграция на первоначальное наполнение данных;
# Дополнительная задача 2.
# - код закоммичен в репозиторий git из ЛБ №0